<template>
  <div>About</div>
  <section class="bg-white-200 py-10 md:py-16">
    <h1 class="text-center mb-3">Ч.З.В</h1>
    <SectionsFaq class="container" :faq="faqs" />
  </section>
</template>

<script setup lang="ts">
import { definePageMeta } from '#imports'

definePageMeta({
  layout: 'custom',
})

const faqs = [
  {
    id: 1,
    question: 'Как зарегистрироваться на вашем сайте и зачем это нужно?',
    answer:
      'После регистрации в Личном кабинете абитуриента на сайте studyinuzbekistan.uz вы получите возможность направить заявку на обучение напрямую в лучшие государственные вузы Узбекистана. Но сначала советуем определиться с направлением обучения, и с вузом, где есть образовательные программы по выбранному вами направлению. Для этого воспользуйтесь нашим поисковым сервисом.\n' +
      'Кстати, программы можно добавлять в «Избранное», чтобы потом было удобно сравнивать. Следующий шаг – регистрация в Личном кабинете. Для этого перейдите по ссылке и укажите адрес своей электронной почты, на него придет письмо с подтверждением. Если этого не произошло через пять-семь минут – проверьте папку «Спам», если письма там нет – напишите в редакцию сайта studyinuzbekistan.uz. После подтверждения регистрации нужно будет заполнить анкету, затем выбрать из списка направление обучения и вуз, один или несколько, куда отправится ваша заявка. В разделе «Дополнительная информация» вы можете дать ссылку на конкретную программу, которая вас интересует. Представители университета ответят вам в течение 10 дней. Попробуйте прямо сейчас.',
  },
  {
    id: 2,
    question: 'Как зарегистрироваться на вашем сайте и зачем это нужно?',
    answer:
      'После регистрации в Личном кабинете абитуриента на сайте studyinuzbekistan.uz вы получите возможность направить заявку на обуче',
  },
]
</script>
