<template>
  <div>
    <UIBreadcrumb :breadcrumb="breadcrumbMenus" />

    <div
      class="max-w-[982px] mx-auto w-full max-sm:px-4 py-4 md:pt-[52px] md:pb-16"
    >
      <h1 class="text-dark font-bold leading-112 text-xl md:text-[28px]">
        Правила использование
      </h1>
      <p
        class="whitespace-break-spaces text-dark text-base md:text-xl leading-140 mt-4"
      >
        Спустя почти 70 лет после победы над фашистским злом и самим богом войны
        Диана Принс (Галь Гадот) ходит на работу в Смитсоновский институт, где
        разбирается с археологическими древностями, а в свободное время спасает
        детей в торговом центре и, возможно, помогает старушкам перейти дорогу.
        Жизнь мисс Принс печальна и одинока: потеряв на великой войне своего
        первого и единственного возлюбленного, летчика Стива (Крис Пайн), она
        так никого и не смогла полюбить — ужинает одна, все друзья и подруги
        остались в прошлом, интересных занятий у нее просто нет. И тут в жизнь
        Дианы врываются перемены: на работу в институт устраивается неловкая, но
        бесконечно милая Барбара (Кристен Уиг), а среди археологических находок
        встречается странный камень, похожий на подделку, но оказывается, что он
        исполняет желания. Своих желаний, как известно, надо бояться: Диана
        мечтает о том, чтобы воскресить Стива, Барбара мечтает быть хотя бы
        немного такой же сексапильной и притягательной, как Диана, а
        трампоподобный нефтяной недомагнат Макс Лорд (Педро Паскаль) мечтает о
        том, чтобы всего в его жизни было побольше: власти, влияния, денег.
        Спустя почти 70 лет после победы над фашистским злом и самим богом войны
        Диана Принс (Галь Гадот) ходит на работу в Смитсоновский институт, где
        разбирается с археологическими древностями, а в свободное время спасает
        детей в торговом центре и, возможно, помогает старушкам перейти дорогу.
        Жизнь мисс Принс печальна и одинока: потеряв на великой войне своего
        первого и единственного возлюбленного, летчика Стива (Крис Пайн), она
        так никого и не смогла полюбить — ужинает одна, все друзья и подруги
        остались в прошлом, интересных занятий у нее просто нет. И тут в жизнь
        Дианы врываются перемены: на работу в институт устраивается неловкая, но
        бесконечно милая Барбара (Кристен Уиг), а среди археологических находок
        встречается странный камень, похожий на подделку, но оказывается, что он
        исполняет желания. Своих желаний, как известно, надо бояться: Диана
        мечтает о том, чтобы воскресить Стива, Барбара мечтает быть хотя бы
        немного такой же сексапильной и притягательной, как Диана, а
        трампоподобный нефтяной недомагнат Макс Лорд (Педро Паскаль) мечтает о
        том, чтобы всего в его жизни было побольше: власти, влияния, денег.
      </p>
    </div>
  </div>
</template>

<script lang="ts" setup>
import { useI18n } from 'vue-i18n'

const { t } = useI18n()

const breadcrumbMenus = [
  {
    title: t('usage-rules'),
    link: '/usage-rules',
  },
]
</script>

<style scoped></style>
